In [4]:
import pandas as pd
# dicionario com nome,sobrenome e idade atual
data = {'nome': ['Ana', 'Bruno', 'Carlos', 'Daniela', 'Eduardo', 'Fábio', 'Giovana', 'Hugo', 'Isabela', 'João'],
        'sobrenome': ['Silva', 'Souza', 'Oliveira', 'Santos', 'Pereira', 'Ferreira', 'Gomes', 'Lima', 'Costa', 'Rodrigues'],
        'idade': [25, 30, 35, 40, 45, 50, 55, 60, 65, 70]}

df = pd.DataFrame(data)
df

      nome  sobrenome  idade
0      Ana      Silva     25
1    Bruno      Souza     30
2   Carlos   Oliveira     35
3  Daniela     Santos     40
4  Eduardo    Pereira     45
5    Fábio   Ferreira     50
6  Giovana      Gomes     55
7     Hugo       Lima     60
8  Isabela      Costa     65
9     João  Rodrigues     70

In [10]:
# filtrando por indexacao .loc condicoes
df.loc[df['idade'] < 30]

  nome sobrenome  idade
0  Ana     Silva     25

In [8]:
# filtrando por indexacao .loc
df.loc[0:5, 'nome']

0        Ana
1      Bruno
2     Carlos
3    Daniela
4    Eduardo
5      Fábio
Name: nome, dtype: object

In [13]:
# filtrando por multiplas condicoes .loc
df.loc[(df['idade'] < 30) & (df['idade'] > 20)]

# filtrando por multiplas condicoes .loc
df.loc[(df['idade'] < 30) | (df['idade'] > 60)]

      nome  sobrenome  idade
0      Ana      Silva     25
8  Isabela      Costa     65
9     João  Rodrigues     70

In [14]:
# filtrando por condicoes com .isin
nome_filtro = ['Ana', 'Bruno', 'Carlos']
df.loc[df['nome'].isin(nome_filtro)]

     nome sobrenome  idade
0     Ana     Silva     25
1   Bruno     Souza     30
2  Carlos  Oliveira     35